[
  {
    "id": "but-doctolib",
    "title": {
      "fr": "Développement d'une copie de l'application Doctolib",
      "en": "Development of a copy of the Doctolib application"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'une application de prise de rendez-vous médicaux.",
      "en": "Development of a medical appointment scheduling application."
    },
    "description": {
      "fr": "Le but de ce projet était de développer une application de prise de rendez-vous médicaux par équipes de 2. L'application devait permettre aux patients de prendre rendez-vous avec des médecins et de gérer leurs rendez-vous.",
      "en": "The purpose of this project was to develop a medical appointment scheduling application by teams of two. The application had to allow patients to make appointments with doctors and manage their appointments."
    },
    "start_date": "2024-01-10",
    "end_date": "2025-01-15",
    "tags": ["school-project", "dev", "web", "ui", "backend"],
    "skills": {
      "html-css-js": {
        "fr": "Développement de la partie front-end de l'application en HTML, CSS et JavaScript.",
        "en": "Development of the front-end part of the application in HTML, CSS and JavaScript."
      },
      "java-Spring-boot": {
        "fr": "Utilisation de Spring Boot pour la gestion des routes et des requêtes : Spring Data JPA, Spring Security, etc.",
        "en": "Use of Spring Boot for route and request management : Spring Data JPA, Spring Security, etc."
      },
      "java": {
        "fr": "Développement de la partie back-end de l'application en Java.",
        "en": "Development of the back-end part of the application in Java."
      },
      "maven": {
        "fr": "Utilisation de Maven pour la gestion des dépendances du projet.",
        "en": "Use of Maven for project dependencies management."
      },
      "sql": {
        "fr": "Utilisation de SQL avec la base de données PostgreSQL pour la gestion des données de l'application en utilisant JPA.",
        "en": "Use of SQL with the PostgreSQL database for data management of the application using JPA."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      }
    }
  },
  {
    "id": "but-risc-v",
    "title": {
      "fr": "Développement d'un simulateur de CPU RISC-V",
      "en": "Development of a RISC-V CPU simulator"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'un simulateur de CPU RISC-V en C.",
      "en": "Development of a RISC-V CPU simulator in C."
    },
    "description": {
      "fr": "Le but de ce projet était de développer un simulateur de CPU RISC-V en C. Le simulateur devait être capable d'exécuter des instructions RISC-V et de simuler le fonctionnement d'un CPU RISC-V.",
      "en": "The purpose of this project was to develop a RISC-V CPU simulator in C. The simulator had to be able to execute RISC-V instructions and simulate the operation of a RISC-V CPU."
    },
    "start_date": "2024-02-10",
    "end_date": "2025-01-14",
    "tags": ["school-project", "dev", "low-level"],
    "skills": {
      "c": {
        "fr": "Développement du simulateur en C. Utilisation de pointeurs, de structures, etc.",
        "en": "Development of the simulator in C. Use of pointers, structures, etc."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      }
    }
  },
  {
    "id": "tonga",
    "title": {
      "fr": "Déploiement d'un SI",
      "en": "Deployment of an IS"
    },
    "location": "Hazebrouck, France",
    "subTitle": {
      "fr": "Déploiement d'un système d'information pour Tonga-Schools Network.",
      "en": "Deployment of an information system for Tonga-Schools Network."
    },
    "description": {
      "fr": "Le but de ce projet était de déployer un système d'information pour Tonga-Schools Network, une association à but éducatifs. Celle ci avait besoin d'un site, d'une platforme de type Moodle ainsi que d'un client / serveur mail.",
      "en": "The purpose of this project was to deploy an information system for Tonga-Schools Network, an educational association. It needed a website, a Moodle-type platform as well as a mail client / server."
    },
    "start_date": "2024-11-05",
    "end_date": "2025-06-10",
    "tags": ["freelance", "work-project", "devops", "cloud", "security"],
    "skills": {
      "debian": {
        "fr": "Installation et configuration du système Debian sur un VPS dédié pour les services.",
        "en": "Installation and configuration of the Debian system on a dedicated VPS for services."
      },
      "network": {
        "fr": "Configuration du réseau : Configuration de l'adresse IP statique. Configuration d'un proxy. Ajout des certificats SSL.",
        "en": "Network configuration : Configuration of the static IP address. Configuration of a proxy. Adding SSL certificates."
      },
      "devops": {
        "fr": "Rédaction d'un fichier d'installation script en bash. Gestion des erreurs, ajout de logs, etc.",
        "en": "Writing an installation script file in bash. Error management, adding logs, etc."
      },
      "presentation": {
        "fr": "Réalisation de la procédure et d'un rapport de projet en utilisant le langage Markdown.",
        "en": "Realization of the procedure and a project report using the Markdown language."
      }
    }
  },
  {
    "id": "lbdd",
    "title": {
      "fr": "Developpement d'un assistant IA-chat",
      "en": "Development of an AI-chat assistant"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'un assistant IA-chat pour un site web.",
      "en": "Development of an AI-chat assistant for a website."
    },
    "description": {
      "fr": "Le but de ce projet était de développer un assistant IA-chat pour le site 'Le Blog du Dirigeant'. L'assistant devait être capable de répondre à des questions simples pour permettre aux utilisateurs de réaliser des schémas simples de visualisation de marché ( PESTEL, SWOT...).",
      "en": "The purpose of this project was to develop an AI-chat assistant for 'Le Blog du Dirigeant' web site. The assistant had to be able to answer simple questions to allow users to make simple market visualization schemes ( PESTEL, SWOT... )."
    },
    "start_date": "2024-09-10",
    "end_date": "2025-02-26",
    "tags": ["freelance", "work-project", "web", "dev", "fullstack"],
    "skills": {
      "react": {
        "fr": "Développement du client de l'application en React.",
        "en": "Development of the client of the application in React."
      },
      "java": {
        "fr": "Développement de la partie back-end de l'application en Java.",
        "en": "Development of the back-end part of the application in Java."
      },
      "maven": {
        "fr": "Utilisation de Maven pour la gestion des dépendances du projet.",
        "en": "Use of Maven for project dependencies management."
      },
      "java-Spring-boot": {
        "fr": "Utilisation de Spring Boot pour la gestion des routes et des requêtes : Spring Data JPA, Spring Security, etc.",
        "en": "Use of Spring Boot for route and request management : Spring Data JPA, Spring Security, etc."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      }
    }
  },
  {
    "id": "but-stage-attestatio",
    "title": {
      "fr": "Attestat.io",
      "en": "Attestat.io"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement de nouvelles fonctionalités.",
      "en": "Development of new features."
    },
    "description": {
      "fr": "Stage de 3 mois chez Attestat.io. Ajout de plusieurs fonctionalités au site web et développement d'un simulateur de taux d'endettement.",
      "en": "3-month internship at Attestat.io. Addition of several features to the website and development of a debt ratio simulator."
    },
    "start_date": "2024-05-27",
    "end_date": "2023-08-14",
    "tags": ["internship", "dev", "web", "ui", "backend"],
    "skills": {
      "figma": {
        "fr": "Réalisation de maquettes pour les nouvelles fonctionnalités sur Figma.",
        "en": "Realization of mockups for new features on Figma."
      },
      "php": {
        "fr": "Développement de nouvelles fonctionnalités pour le site web en PHP. Utilisation de Symfony et du moteur de rendu Twig.",
        "en": "Development of new features for the website in PHP. Use of Symfony and the Twig rendering engine."
      },
      "html-css-js": {
        "fr": "Développement de la partie front-end du site web en HTML, CSS et JavaScript.",
        "en": "Development of the front-end part of the website in HTML, CSS and JavaScript."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      }
    }
  },
  {
    "id": "but-res-api",
    "title": {
      "fr": "API REST - Pizzeria",
      "en": "REST API - Pizzeria"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'une API REST pour une pizzeria.",
      "en": "Development of a REST API for a pizzeria."
    },
    "description": {
      "fr": "Le but de ce projet était de développer une API REST pour une pizzeria par équipe de 2. L'API devait permettre de gérer les pizzas, leurs compositions ainsi que les commandes.",
      "en": "The purpose of this project was to develop a REST API for a pizzeria by team of two. The API had to allow to manage pizzas, their composition as well as orders."
    },
    "start_date": "2023-09-10",
    "end_date": "2023-12-10",
    "tags": ["school-project", "dev", "backend", "database"],
    "skills": {
      "java": {
        "fr": "Développement de l'API en Java. Utilisation de Apache Tomcat pour l'API REST et la gestion des routes. Java-SQL était utilisé pour la gestion des données.",
        "en": "Development of the API in Java. Use of Apache Tomcat for the REST API and route management. Java-SQL was used for data management."
      },
      "sql": {
        "fr": "Utilisation de SQL avec la base de données PostgreSQL pour la gestion des données de l'API.",
        "en": "Use of SQL with the PostgreSQL database for data management of the API."
      },
      "json": {
        "fr": "Utilisation de JSON pour la gestion des données échangées entre le client et le serveur.",
        "en": "Use of JSON for data management exchanged between the client and the server."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      }
    }
  },
  {
    "id": "but-js-game",
    "title": {
      "fr": "Jeu JavaScript",
      "en": "JavaScript Game"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'un jeu en JavaScript.",
      "en": "Development of a game in JavaScript."
    },
    "description": {
      "fr": "Développement d'un jeu de tir à défilement en JavaScript. Le but du jeu était de détruire les ennemis en évitant les obstacles.",
      "en": "Development of a scrolling shooting game in JavaScript. The goal of the game was to destroy the enemies while avoiding obstacles."
    },
    "start_date": "2023-01-10",
    "end_date": "2023-06-30",
    "tags": ["school-project", "dev", "game", "ui", "web"],
    "skills": {
      "html-css-js": {
        "fr": "Développement du jeu en JavaScript. Utilisation de Canva pour la partie graphique.",
        "en": "Development of the game in JavaScript. Use of Canva for the graphical part."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      },
      "node": {
        "fr": "Utilisation de Node.js pour la gestion des dépendances du projet.",
        "en": "Use of Node.js for project dependencies management."
      },
      "soket-io": {
        "fr": "Utilisation de Socket.io pour la gestion des échanges entre le client et le serveur.",
        "en": "Use of Socket.io for managing exchanges between the client and the server."
      },
      "presentation": {
        "fr": "Réalisation d'une présentation du projet en utilisant le language Markdown.",
        "en": "Realization of a project presentation using the Markdown language."
      }
    }
  },
  {
    "id": "but-matrix-instance",
    "title": {
      "fr": "Instance Matrix",
      "en": "Matrix Instance"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Installation d'une instance matrix sur une machine virtuelle Debian.",
      "en": "Installation of a matrix instance on a Debian virtual machine."
    },
    "description": {
      "fr": "Le but de ce projet était d'installer une instance Matrix sur une machine virtuelle Debian. L'instance devait être fonctionnelle et permettre la communication entre plusieurs utilisateurs.",
      "en": "The purpose of this project was to install a Matrix instance on a Debian virtual machine. The instance had to be functional and allow communication between several users."
    },
    "start_date": "2023-10-10",
    "end_date": "2024-01-10",
    "tags": ["school-project", "devops", "security"],
    "skills": {
      "debian": {
        "fr": "Utilisation de Debian OS. Installation et configuration des logiciels sur le serveur Debian.",
        "en": "Use of Debian OS. Installation and configuration of software on the Debian server."
      },
      "devops": {
        "fr": "Rédaction d'un fichier d'installation script en bash. Gestion des erreurs, ajout de logs, etc.",
        "en": "Writing an installation script file in bash. Error management, adding logs, etc."
      },
      "security": {
        "fr": "Configuration de la sécurité : configuration du pare-feu, configuration des droits d'accès, etc.",
        "en": "Security configuration : firewall configuration, access rights configuration, etc."
      },
      "sql": {
        "fr": "Utilisation de SQL avec la base de données PostgreSQL pour la gestion des données de l'instance.",
        "en": "Use of SQL with the PostgreSQL database for data management of the instance."
      },
      "docker": {
        "fr": "Utilisation de Docker pour l'installation de l'instance Matrix. Utilisation de Docker-compose pour la gestion des conteneurs.",
        "en": "Use of Docker for the installation of the Matrix instance. Use of Docker-compose for container management."
      },
      "presentation": {
        "fr": "Réalisation de la procédure et d'un rapport de projet en utilisant le language Markdown. Utilisation de LaTeX pour l'export au format PDF.",
        "en": "Realization of the procedure and a project report using the Markdown language. Use of LaTeX for export to PDF format."
      }
    }
  },
  {
    "id": "but-maze-game",
    "title": {
      "fr": "Jeu de Labyrinthe",
      "en": "Maze Game"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'un jeu de labyrinthe 'Chasse au monstre'.",
      "en": "Development of a maze game 'Monster Hunt'."
    },
    "description": {
      "fr": "Le but du jeux était de trouver le monstre caché dans le labyrinthe. Le joueur devait se déplacer dans le labyrinthe pour trouver le monstre. Les deux entités pouvaient être automatisées.",
      "en": "The goal of the game was to find the monster hidden in the maze. The player had to move in the maze to find the monster. The two entities could be automated."
    },
    "start_date": "2023-01-10",
    "end_date": "2024-01-10",
    "tags": ["school-project", "dev", "game", "ui"],
    "skills": {
      "java": {
        "fr": "Développement du jeu en Java. Élaboration et Transposition d'algorithmes de recherches de chemin dans le labyrinthe pour l'automatisation.",
        "en": "Development of the game in Java. Élaboration and Transposition of path search algorithms in the maze for automation."
      },
      "javaFx": {
        "fr": "Utilisation de JavaFx pour la partie graphique du jeu. Définition d'un interface de couleurs pour les éléments graphiques du jeu. Implémentation du shéma MVC.",
        "en": "Use of JavaFx for the graphical part of the game. Definition of a color interface for the graphic elements of the game. Implementation of the MVC schema."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      },
      "csv": {
        "fr": "Utilisation de fichiers CSV pour stocker les données des labyrinthes. Internationalisation du jeu avec plusieurs langues disponibles.",
        "en": "Use of CSV files to store maze data. Internationalization of the game with several languages available."
      }
    }
  },
  {
    "id": "but-agile-project",
    "title": {
      "fr": "Projet Agile",
      "en": "Agile Project"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'une application de gestion de projet en méthode Agile.",
      "en": "Development of a project management application in Agile method."
    },
    "description": {
      "fr": "L'application permettait de gérer des projets en méthode Agile. Les utilisateurs pouvaient créer des projets, des tâches, des sprints, etc. L'application permettait de suivre l'avancement des projets et des tâches.",
      "en": "The application allowed to manage projects in Agile method. Users could create projects, tasks, sprints, etc. The application allowed to follow the progress of projects and tasks."
    },
    "start_date": "2023-09-04",
    "end_date": "2023-09-06",
    "tags": ["school-project", "dev"],
    "skills": {
      "project-management": {
        "fr": "Gestion de projet : Utilisation de la méthode Agile, Scrum.",
        "en": "Project management : Use of the Agile method, Scrum."
      },
      "java": {
        "fr": "Développement de l'application en Java.",
        "en": "Development of the application in Java."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      }
    }
  },

  {
    "id": "but-pair-app",
    "title": {
      "fr": "Application d'appairage",
      "en": "Pairing Application"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Application de gestion des binômes pour un voyage scolaire.",
      "en": "Management application for pairs for a school trip."
    },
    "description": {
      "fr": "L'application permettait de gérer les binômes pour un voyage scolaire. Les élèves devaient être répartis en binômes pour les activités du voyage. L'application permettait de créer des binômes aléatoires ou de choisir les binômes manuellement.",
      "en": "The application allowed to manage pairs for a school trip. Students had to be divided into pairs for the activities of the trip. The application allowed to create random pairs or to choose the pairs manually."
    },
    "start_date": "2023-03-10",
    "end_date": "2023-06-30",
    "tags": ["school-project", "dev", "ui", "backend"],
    "skills": {
      "csv": {
        "fr": "Gestion des données des élèves via des fichiers CSV. Posibilité d'établir des profils et des préferences elles-mêmes sauvegardées dans des fichiers CSV ( Données persistantes ).",
        "en": "Management of student data via CSV files. Possibility to establish profiles and preferences themselves saved in CSV files ( Persistent data )."
      },
      "java": {
        "fr": "Développement de l'application en Java. Utilisation de JavaFx pour la partie graphique.",
        "en": "Development of the application in Java. Use of JavaFx for the graphical part."
      },
      "figma": {
        "fr": "Réalisation de la maquette de l'application sur Figma.",
        "en": "Realization of the mockup of the application on Figma."
      },
      "git": {
        "fr": "Gestion du projet via Git. Utilisation de branches pour le développement de fonctionnalités.",
        "en": "Project management via Git. Use of branches for the development of features."
      }
    }
  },
  {
    "id": "but-sql-jo",
    "title": {
      "fr": "Ventilation de données",
      "en": "Data Ventilation"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Ventilation d'un jeu de données en utilisant les outils de requêtes SQL.",
      "en": "Ventilation of a data set using SQL query tools."
    },
    "description": {
      "fr": "Le but de ce projet était de ventiler un jeu de données sur les Jeux Olympiques en utilisant des requêtes SQL. Les données étaient fournies au format CSV. Les requêtes devaient permettre d'accéder aux données en fonction de critères précis.",
      "en": "The purpose of this project was to ventilate a data set about Olympic Game using SQL queries. The data was given in CSV format. The queries had to allow access to the data according to specific criteria."
    },
    "start_date": "2023-02-12",
    "end_date": "2023-04-10",
    "tags": ["school-project", "database", "presentation"],
    "skills": {
      "sql": {
        "fr": "Utilisation de SQL avec la base de données PostgreSQL pour la ventilation des données. Supression des données inutiles, jointures, ect. Design d'un MCD et d'un MLD pour la base de données.",
        "en": "Use of SQL with the PostgreSQL database for data ventilation. Deletion of unnecessary data, joins, etc. Design of a MCD and a MLD for the database."
      },
      "presentation": "Réalisation d'un rapport de projet en utilisant le language Markdown. Export au format PDF."
    }
  },
  {
    "id": "but-installation-auto",
    "title": {
      "fr": "Installation Automatique",
      "en": "Automatic Installation"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Installation de Debian sur un parc de machine virtuelle.",
      "en": "Automatic installation of Debian on a virtual machine park."
    },
    "description": {
      "fr": "Le but de ce projet était d'installer de manière automatisée un système Débian préconfiguré sur plusieurs machines virtuelles. Le script devait installer plusieurs logiciels et les configurer automatiquement.",
      "en": "The purpose of this project was to automatically install a preconfigured Debian system on several virtual machines. The script had to install several software and configure them automatically."
    },
    "start_date": "2023-01-10",
    "end_date": "2023-03-10",
    "tags": ["school-project", "devops", "security"],
    "skills": {
      "debian": {
        "fr": "Utilisation de Debian OS. Installation et configuration des logiciels sur le serveur Debian.",
        "en": "Use of Debian OS. Installation and configuration of software on the Debian server."
      },
      "presentation": {
        "fr": "Réalisation de la procédure et d'un rapport de projet en utilisant le language Markdown. Utilisation de LaTeX pour l'export au format PDF.",
        "en": "Realization of the procedure and a project report using the Markdown language. Use of LaTeX for export to PDF format."
      },
      "devops": {
        "fr": "Rédaction d'un fichier d'installation script en bash. Gestion des erreurs, ajout de logs, etc.",
        "en": "Writing an installation script file in bash. Error management, adding logs, etc."
      },
      "security": {
        "fr": "Configuration de la sécurité : configuration du pare-feu, configuration des droits d'accès, etc.",
        "en": "Security configuration : firewall configuration, access rights configuration, etc."
      }
    }
  },
  {
    "id": "but-escape-game",
    "title": {
      "fr": "Escape Game",
      "en": "Escape Game"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Développement d'un jeu d'escape game avec Genially.",
      "en": "Development of an escape game with Genially."
    },
    "description": {
      "fr": "Le jeu consistait à résoudre des énigmes pour s'échapper d'une pièce. Les énigmes étaient de différents types : mathématiques, logiques, etc. Le but ici n'était pas d'évaluer la partie technique mais de faire de la gestion de projet et de la communication.",
      "en": "The game consisted of solving puzzles to escape from a room. The puzzles were of different types: mathematics, logic, etc. The goal here was not to evaluate the technical part but to do project management and communication."
    },
    "start_date": "2023-02-23",
    "end_date": "2023-04-26",
    "tags": ["school-project", "game", "ui", "design"],
    "skills": {
      "presentation": {
        "fr": "Utilisation de Genially pour la création du jeu d'escape game.",
        "en": "Use of Genially for the creation of the escape game."
      },
      "project-management": {
        "fr": "Gestion du projet : Répartition des tâches, réunions, etc.",
        "en": "Project management : Task allocation, meetings, etc."
      },
      "communication": {
        "fr": "Communication : Réunions, compte-rendus, etc.",
        "en": "Communication : Meetings, reports, etc."
      }
    }
  },
  {
    "id": "but-debian-installation",
    "title": {
      "fr": "Installation Debian",
      "en": "Debian Installation"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Installation d'un serveur Debian sur une machine virtuelle.",
      "en": "Installation on a virutal Machine."
    },
    "description": {
      "fr": "Prise en main du sytème Linux. Installation complète du système sur la machine virtuelle.",
      "en": "Getting started with the Linux system. Complete installation of the system on the virtual machine."
    },
    "start_date": "2022-09-15",
    "end_date": "2022-11-26",
    "tags": ["school-project", "devops", "security"],
    "skills": {
      "system": {
        "fr": "Installation et configuration du système Debian. Ajout de plusieurs utilisateurs groupes avec des autorisations différentes. Installation de paquets.",
        "en": "Installation and configuration of the Debian system. Adding several user groups with different permissions. Installation of packages."
      },
      "network": {
        "fr": "Configuration du réseau : Configuration de l'adresse IP statique. Configuration d'un proxy.",
        "en": "Network configuration : Configuration of the static IP address. Configuration of a proxy."
      }
    }
  },

  {
    "id": "but-educational-game",
    "title": {
      "fr": "Jeu Ludo Pédagogique",
      "en": "Educational Game"
    },
    "location": "Lille, France",
    "subTitle": {
      "fr": "Developpement d'un jeu ludo-pédagoique à destination d'élèves du primaire.",
      "en": "Development of an educational game for primary school students."
    },
    "description": {
      "fr": "Notre jeu portait sur l'apprentissage et la révision des mathématiques, sur les opérations primaires ( addition, soustraction, multiplication et division ). Le but du jeu était de détruire les tours de l'adversaire en répondant correctement aux questions posées.",
      "en": "Our game was about learning and revising mathematics, on primary operations (addition, subtraction, multiplication and division). The goal of the game was to destroy the opponent's towers by correctly answering the questions asked."
    },
    "start_date": "2022-01-10",
    "end_date": "2022-06-30",
    "tags": ["school-project", "dev", "game"],
    "skills": {
      "java": {
        "fr": "Développement du jeu en Java.",
        "en": "Development of the game in Java."
      },
      "csv": {
        "fr": "Utilisation de fichiers CSV pour stocker les questions et les réponses.",
        "en": "Use of CSV files to store questions and answers."
      }
    }
  },

  {
    "id": "but-ubisoft-web-site",
    "title": {
      "fr": "Site Web Ubisoft Mobilité",
      "en": "Ubisoft Web Site Mobility"
    },
    "location": "Lille, France",
    "subTitle": {
      "en": "Development of a fictitious website for the company's mobility project.",
      "fr": "Développer un site web fictif pour le projet de mobilité de l'entreprise."
    },
    "description": {
      "en": "The site is a showcase for the company's mobility project. Employees had to be able to select a means of transport and reserve it to ensure their daily journey.",
      "fr": "Le site est une vitrine pour le projet de mobilité de l'entreprise. Les employées devaient pouvoir seléctionner un moyen de transport et le réserver pour assurer le trajet quotidien."
    },
    "start_date": "2022-09-26",
    "end_date": "2022-01-10",
    "tags": ["school-project", "dev", "web", "ui"],
    "skills": {
      "html-css-js": {
        "fr": "Developpement de la partie front-end du site web en HTML et CSS. Utilisation d'une struture simple via HTML uniquement.",
        "en": "Development of the front-end part of the website in HTML and CSS. Use of a simple structure via HTML only."
      },
      "WordPress": {
        "fr": "Réalisation d'une maquette du site web sur WordPress.",
        "en": "Realization of a mockup of the website on WordPress."
      }
    }
  },
  {
    "id": "but",
    "title": {
      "fr": "Université de Lille",
      "en": "University of Lille"
    },
    "location": "Lille, France",
    "subTitle": {
      "en": "University Technology Bachelor (DUT)",
      "fr": "Bachelor Univeritaire de Technologie (BUT)"
    },
    "description": {
      "en": "Parcours : Development of Communicating and Secure Applications.",
      "fr": "Parcours : Développement d'Applications Communicantes et Sécurisées."
    },
    "start_date": "2022-09-01",
    "end_date": "null",
    "tags": ["school"]
  },
  {
    "id": "bac",
    "title": {
      "fr": "Lycée Saint Jude",
      "en": "Saint Jude High School"
    },
    "location": "Armentières, France",
    "subTitle": {
      "en": "High School General Diploma",
      "fr": "Baccalauréat Général"
    },
    "description": {
      "en": "Specialization : Mathematics Computer Science Economy.",
      "fr": "Spécialités : Mathématiques Informatique Économie."
    },
    "start_date": "2020-09-01",
    "end_date": "2022-06-30",
    "tags": ["school"]
  }
]
